#PANDAS (PANel DAta) is a high-level data manipulation tool used for analysing data.
It is very easy to import and export data using Pandas library which has a very
rich set of functions.

It is built on packages like NumPy and Matplotlib and gives us a single, convenient place to do most of our data analysis and visualisation work.

Pandas has three important data structuresâ€“Series, DataFrame and Panel to make the process of analysing data organised, effective and efficient.

In [2]:
#Data Structure in Pandas
#Series
#DataFrame

In [3]:
#Series
#A Series is a one-dimensional array containing a sequence of values of any data type (int, float, list,string, etc) which by default have numeric data labels starting from zero.

In [4]:
# Creation of Series
import pandas as pd #import Pandas with alias pd
series1 = pd.Series([10,20,30]) #create a Series
print(series1) #Display the series

0    10
1    20
2    30
dtype: int64

In [5]:
#Example has a numeric index in random order.
series2 = pd.Series(["Kavi","Shyam","Ravi"], index=[3,5,1])
print(series2)

3     Kavi
5    Shyam
1     Ravi
dtype: object

In [6]:
# Creation of Series from NumPy Arrays
#Series from a one-dimensional (1D) NumPy array:
import numpy as np # import NumPy with alias np
import pandas as pd
array1 = np.array([1,2,3,4])
series3 = pd.Series(array1)
print(series3)

0    1
1    2
2    3
3    4
dtype: int32

In [7]:
y=np.array([1,2,3,5,7,455])
x=pd.Series(y,index=["A","B","C","D","E","F"])
print(x)

A      1
B      2
C      3
D      5
E      7
F    455
dtype: int32

In [8]:
# we can use letters or strings as indices:
array1 = np.array([1,2,3,4])
series4 = pd.Series(array1, index = ["Jan","Feb", "Mar","Apr"])
print(series4)

Jan    1
Feb    2
Mar    3
Apr    4
dtype: int32

In [9]:
x={"India":"Sahil","America":"Josh","Thailand":"Yoshua"}
df=pd.Series(x)
print(df)

India        Sahil
America       Josh
Thailand    Yoshua
dtype: object

In [10]:
#Creation of Series from Dictionary
dict1 = {'India': 'NewDelhi', 'UK':
'London', 'Japan': 'Tokyo'}
print(dict1) #Display the dictionary
{'India': 'NewDelhi', 'UK': 'London', 'Japan':
'Tokyo'}

{'India': 'NewDelhi', 'UK': 'London', 'Japan': 'Tokyo'}

{'India': 'NewDelhi', 'UK': 'London', 'Japan': 'Tokyo'}

In [11]:
series8 = pd.Series(dict1)
print(series8)

India    NewDelhi
UK         London
Japan       Tokyo
dtype: object

In [12]:
# Accessing Elements of a Series
import pandas as pd
seriesNum = pd.Series([10,20,30],index=["A","B","C"])
seriesNum[:1]

A    10
dtype: int64

In [13]:
seriesMnths = pd.Series([2,3,4],index=["Feb","Mar","Apr"])
seriesMnths["Mar"]

3

In [14]:
seriesNum[2]

C:\Users\sb193\AppData\Local\Temp\ipykernel_7044\690033389.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  seriesNum[2]

30

In [15]:
#Slicing
seriesCapCntry = pd.Series(['NewDelhi', 'WashingtonDC', 'London','Paris'], index=['India', 'USA', 'UK', 'France'])
seriesCapCntry

India         NewDelhi
USA       WashingtonDC
UK              London
France           Paris
dtype: object

In [16]:
seriesCapCntry[1:3]

USA    WashingtonDC
UK           London
dtype: object

In [17]:
#Methods of Series
import numpy as np
seriesTenTwenty=pd.Series(np.arange(10,20, 1 ))
print(seriesTenTwenty)

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32

In [18]:
seriesTenTwenty.head(2)

0    10
1    11
dtype: int32

In [19]:
seriesTenTwenty.count()

10

In [20]:
seriesTenTwenty.tail(2)

8    18
9    19
dtype: int32

In [21]:
# Mathematical Operations on Series
seriesA = pd.Series([1,2,3,4,5], index =['a', 'b', 'c', 'd', 'e'])
seriesA

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [22]:
seriesB = pd.Series([10,20,-10,-50,100],
index = ['z', 'y', 'a', 'c', 'e'])
seriesB

z     10
y     20
a    -10
c    -50
e    100
dtype: int64

In [23]:
#that the output of addition is NaN if one of the elements or both elements have no value.
seriesA + seriesB

a     -9.0
b      NaN
c    -47.0
d      NaN
e    105.0
y      NaN
z      NaN
dtype: float64

In [24]:
#Subtraction of two Series
seriesA - seriesB

a    11.0
b     NaN
c    53.0
d     NaN
e   -95.0
y     NaN
z     NaN
dtype: float64

In [25]:
#Multiplication of two Series
seriesA * seriesB

a    -10.0
b      NaN
c   -150.0
d      NaN
e    500.0
y      NaN
z      NaN
dtype: float64

In [26]:
# Division of two Series
seriesA/seriesB

a   -0.10
b     NaN
c   -0.06
d     NaN
e    0.05
y     NaN
z     NaN
dtype: float64

#DataFrame
A DataFrame is a two-dimensional labelled data structure like a table of MySQL.
It contains rows and columns, and therefore has both a row and column index.
Each column can have a different type of value such as numeric, string,
boolean, etc., as in tables of a database.

In [28]:
# Creation of DataFrame
# Creation of DataFrame from NumPy ndarrays
import numpy as np
array1 = np.array([10,20,30])
array2 = np.array([100,200,300])
array3 = np.array([-10,-20,-30, -40])
dFrame4 = pd.DataFrame(array1)
dFrame4

    0
0  10
1  20
2  30

In [29]:
#Creation of DataFrame from List of Dictionaries
listDict = [{'a':10, 'b':20}, {'a':5,'b':10, 'c':20}]
dFrameListDict = pd.DataFrame(listDict)
dFrameListDict

    a   b     c
0  10  20   NaN
1   5  10  20.0

In [30]:
x=pd.Series([2,3,45,34],index=["A","B","C","D"])
y=pd.Series([12,23,34,453],index=["A","B","C","D"])
df=pd.DataFrame([x,y])
df

    A   B   C    D
0   2   3  45   34
1  12  23  34  453

In [31]:
#Creation of DataFrame from Series
seriesA = pd.Series([1,2,3,4,5],index = ['a', 'b', 'c', 'd', 'e'])
seriesB = pd.Series ([1000,2000,-1000,-5000,1000],index = ['a', 'b', 'c', 'd', 'e'])
seriesC = pd.Series([10,20,-10,-50,100],index = ['z', 'y', 'a', 'c', 'e'])

dFrame6 = pd.DataFrame(seriesA)
dFrame6

   0
a  1
b  2
c  3
d  4
e  5

In [32]:
dFrame7 = pd.DataFrame([seriesA, seriesB])
dFrame7

      a     b     c     d     e
0     1     2     3     4     5
1  1000  2000 -1000 -5000  1000

In [33]:
# Creation of DataFrame from Dictionary of Series
ResultSheet={'Arnab': pd.Series([90, 91, 97],index=['Maths','Science','Hindi']),
'Ramit': pd.Series([92, 81, 96],index=['Maths','Science','Hindi']),
'Sahir': pd.Series([89, 91, 88],index=['Maths','Science','Hindi']),
'Riya': pd.Series([81, 71, 67],index=['Maths','Science','Hindi']),
'Mallika': pd.Series([94, 95, 99],index=['Maths','Science','Hindi'])}
ResultDF = pd.DataFrame(ResultSheet)
ResultDF

         Arnab  Ramit  Sahir  Riya  Mallika
Maths       90     92     89    81       94
Science     91     81     91    71       95
Hindi       97     96     88    67       99

In [34]:
df={"Kakul":pd.Series([16,18,20,20,20],index=["Python","Sql","Stats","Excel","Fp"]),
"Nitin":pd.Series([17,17,20,20,20],index=["Python","Sql","Stats","Excel","Fp"])}
sub=pd.DataFrame(df)
sub

        Kakul  Nitin
Python     16     17
Sql        18     17
Stats      20     20
Excel      20     20
Fp         20     20

In [35]:
sub["Suneet"]=[20,19,20,20,20]
sub

        Kakul  Nitin  Suneet
Python     16     17      20
Sql        18     17      19
Stats      20     20      20
Excel      20     20      20
Fp         20     20      20

In [36]:
sub.loc["Total"]=[88,89,99]
sub

        Kakul  Nitin  Suneet
Python     16     17      20
Sql        18     17      19
Stats      20     20      20
Excel      20     20      20
Fp         20     20      20
Total      88     89      99

In [37]:
#Operations on rows and columns in DataFrames
#Adding a New Column to a DataFrame
ResultDF['Jimmy']=[89,78,76]
ResultDF

         Arnab  Ramit  Sahir  Riya  Mallika  Jimmy
Maths       90     92     89    81       94     89
Science     91     81     91    71       95     78
Hindi       97     96     88    67       99     76

In [38]:
#Adding a New Row to a DataFrame
#DataFRame.loc[] method can also be used to change the data values of a row to a particular value.
ResultDF.loc['English'] = [85, 86, 83, 80, 90, 89]
ResultDF

         Arnab  Ramit  Sahir  Riya  Mallika  Jimmy
Maths       90     92     89    81       94     89
Science     91     81     91    71       95     78
Hindi       97     96     88    67       99     76
English     85     86     83    80       90     89

In [39]:
#Deleting Rows or Columns from a DataFrame
#delete the row with label 'Science'
ResultDF = ResultDF.drop('Science', axis=0)
ResultDF

         Arnab  Ramit  Sahir  Riya  Mallika  Jimmy
Maths       90     92     89    81       94     89
Hindi       97     96     88    67       99     76
English     85     86     83    80       90     89

In [40]:
#Delete the columns having labels  'Ramit' and 'Riya':

ResultDF = ResultDF.drop(['Ramit','Riya'], axis=1)
ResultDF

         Arnab  Sahir  Mallika  Jimmy
Maths       90     89       94     89
Hindi       97     88       99     76
English     85     83       90     89

In [41]:
#Renaming Row Labels of a DataFrame
#To rename the row indices Maths to sub1, Science to sub2, Hindi to sub3 and English to sub4 we can write the following statement:
ResultDF=ResultDF.rename({'Maths':'Sub1','English':'Sub3','Hindi':'Sub4'}, axis='index')
print(ResultDF)

      Arnab  Sahir  Mallika  Jimmy
Sub1     90     89       94     89
Sub4     97     88       99     76
Sub3     85     83       90     89

In [42]:
#Accessing DataFrames Element through Indexing
#Label Based Indexing
ResultDF.loc['Sub3']

Arnab      85
Sahir      83
Mallika    90
Jimmy      89
Name: Sub3, dtype: int64

In [43]:
ResultDF.loc['Sub1': 'Sub4']

      Arnab  Sahir  Mallika  Jimmy
Sub1     90     89       94     89
Sub4     97     88       99     76